

RESULT_TEXT = """
Запрос № <b>{a[0]}</b>
Поток: <b>{a[1]}</b>
День недели: <b>{a[2]}</b>
Номер пары: <b>{a[3]}</b>
Корпус: <b>{a[4]}</b>
Кабинет: <b>{a[5]}</b>
Причина: <b>{a[6]}</b>

"""


FINAL_TEXT = """
Запрос № <b>{a[0]}</b>
Поток: <b>{a[1]}</b>
День недели: <b>{a[2]}</b>
Номер пары: <b>{a[3]}</b>
Корпус: <b>{a[4]}</b>
Кабинет: <b>{a[5]}</b>
Причина: <b>{a[6]}</b>

Статус: <b>{b}</b>
"""

WEEDDAYS = {
    "1": "Понедельник",
    "2": "Вторник",
    "3": "Среда",
    "4": "Четверг",
    "5": "Пятница",
    "6": "Суббота",
    "7": "Воскресенье"
}